---
type: RebarHookType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 9
tags: [revit-api, class]
---

# RebarHookType

`Autodesk.Revit.DB.Structure.RebarHookType` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static RebarHookType Create ( Document doc , double angle , double multiplier )` |
| Method | CreateDefaultRebarHookType | 2015 | `public static ElementId CreateDefaultRebarHookType ( Document ADoc )` |
| Method | GetDefaultHookExtension | — | `public double GetDefaultHookExtension ( double barDiameter )` |
| Method | GetHookExtensionLength | — | `public double GetHookExtensionLength ( RebarBarType barType )` |
| Method | IsOffsetLengthRequired | — | `public bool IsOffsetLengthRequired ()` |
| Property | HookAngle | — | `public double HookAngle { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | StraightLineMultiplier | — | `public double StraightLineMultiplier { get ; set ; }` |
| Property | Style | — | `public RebarStyle Style { get ; set ; }` |